# MajorSpacingFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..MajorSpacingFailure Property
BuiltInFailures..::..FabricFailures Class See Also
---
The spacing in the major direction is lower than diameter of the wire in the minor direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MajorSpacingFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MajorSpacingFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MajorSpacingFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace